wujique/stm32f407/board_dev/dev_ILI9341.c
s32 drv_ILI9325_init(DevLcdNode *lcd);
static s32 drv_ILI9325_drawpoint(DevLcdNode *lcd, u16 x, u16 y, u16 color);
s32 drv_ILI9325_color_fill(DevLcdNode *lcd, u16 sx,u16 sy,u16 ex,u16 ey,u16 color);
s32 drv_ILI9325_fill(DevLcdNode *lcd, u16 sx,u16 sy,u16 ex,u16 ey,u16 *color);
static s32 drv_ILI9325_display_onoff(DevLcdNode *lcd, u8 sta);
s32 drv_ILI9325_prepare_display(DevLcdNode *lcd, u16 sc, u16 ec, u16 sp, u16 ep);
static void drv_ILI9325_scan_dir(DevLcdNode *lcd, u8 dir);
void drv_ILI9325_lcd_bl(DevLcdNode *lcd, u8 sta);
/*

	9325驱动

*/
_lcd_drv TftLcdILI9325Drv = {
							.id = 0X9325,

							.init = drv_ILI9325_init,
							.draw_point = drv_ILI9325_drawpoint,
							.color_fill = drv_ILI9325_color_fill,
							.fill = drv_ILI9325_fill,
							.onoff = drv_ILI9325_display_onoff,
							.prepare_display = drv_ILI9325_prepare_display,
							.set_dir = drv_ILI9325_scan_dir,
							.backlight = drv_ILI9325_lcd_bl
							};
void drv_ILI9325_lcd_bl(DevLcdNode *lcd, u8 sta)
{
	DevLcdBusNode * node;
	
	node = bus_lcd_open(lcd->dev.buslcd);
	bus_lcd_bl(node, sta);
	bus_lcd_close(node);

}	
/**
 *@brief:	   drv_ILI9325_scan_dir
 *@details:    设置显存扫描方向
 *@param[in]   u8 dir  
 *@param[out]  无
 *@retval:	   static OK
 */
static void drv_ILI9325_scan_dir(DevLcdNode *lcd, u8 dir)
{
	u16 regval=0;
	u8 dirreg=0;
	
	switch(dir)
    {
        case L2R_U2D://从左到右,从上到下
            regval|=(1<<5)|(1<<4)|(0<<3); 
            break;
        case L2R_D2U://从左到右,从下到上
            regval|=(0<<5)|(1<<4)|(0<<3); 
            break;
        case R2L_U2D://从右到左,从上到下
            regval|=(1<<5)|(0<<4)|(0<<3);
            break;
        case R2L_D2U://从右到左,从下到上
            regval|=(0<<5)|(0<<4)|(0<<3); 
            break;   
        case U2D_L2R://从上到下,从左到右
            regval|=(1<<5)|(1<<4)|(1<<3); 
            break;
        case U2D_R2L://从上到下,从右到左
            regval|=(1<<5)|(0<<4)|(1<<3); 
            break;
        case D2U_L2R://从下到上,从左到右
            regval|=(0<<5)|(1<<4)|(1<<3); 
            break;
        case D2U_R2L://从下到上,从右到左
            regval|=(0<<5)|(0<<4)|(1<<3); 
            break;   
    }
	
    dirreg=0X03;
    regval|=1<<12;  

	u16 tmp[16];
	DevLcdBusNode * node;
	
	node = bus_lcd_open(lcd->dev.buslcd);
	
	bus_lcd_write_cmd(node, (dirreg));
	tmp[0] = regval;
	bus_lcd_write_data(node, (u8*)tmp, 1);
	
	bus_lcd_close(node);

}

/**
 *@brief:      drv_ILI9325_set_cp_addr
 *@details:    设置控制器的行列地址范围
 *@param[in]   u16 sc  
               u16 ec  
               u16 sp  
               u16 ep  
 *@param[out]  无
 *@retval:     9325设置扫描区域有一个限制，那就是窗口宽度不能小于四
 */
static s32 drv_ILI9325_set_cp_addr(DevLcdNode *lcd, u16 hsa, u16 hea, u16 vsa, u16 vea)
{
	u16 heatmp;
	u16 tmp[2];
	DevLcdBusNode * node;
	
	node = bus_lcd_open(lcd->dev.buslcd);

	/* 设置扫描窗口 */
	if((hsa+4) > hea)
		heatmp = hsa+4;
	else
		heatmp = hea;
	
	bus_lcd_write_cmd(node, (0x0050));//HSA
	tmp[0] = hsa;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0051));//HEA
	tmp[0] = heatmp;
	bus_lcd_write_data(node, (u8*)tmp, 1);
	
	bus_lcd_write_cmd(node, (0x0052));//VSA
	tmp[0] = vsa;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0053));//VEA
	tmp[0] = vea;
	bus_lcd_write_data(node, (u8*)tmp, 1);
	
	/*
		设置扫描起始地址。
	*/
	if((lcd->scandir&LR_BIT_MASK) == LR_BIT_MASK)
	{
		bus_lcd_write_cmd(node, (ILI9325_CMD_SETH));
		tmp[0] = hea&0XFF;
		bus_lcd_write_data(node, (u8*)tmp, 1);
	
	}
	else
	{
		bus_lcd_write_cmd(node, (ILI9325_CMD_SETH));
		tmp[0] = hsa&0XFF;
		bus_lcd_write_data(node, (u8*)tmp, 1);
			  
	}

	if((lcd->scandir&UD_BIT_MASK) == UD_BIT_MASK)
	{
		bus_lcd_write_cmd(node, (ILI9325_CMD_SETV));
		tmp[0] = vea&0X1FF;
		bus_lcd_write_data(node, (u8*)tmp, 1);
		
	}
	else
	{
		bus_lcd_write_cmd(node, (ILI9325_CMD_SETV));
		tmp[0] = vsa&0X1FF;
		bus_lcd_write_data(node, (u8*)tmp, 1);
	}
	bus_lcd_write_cmd(node, (ILI9325_CMD_WRAM));
	bus_lcd_close(node);
	return 0;
}

/**
 *@brief:	   drv_ILI9325_display_onoff
 *@details:    显示或关闭
 *@param[in]   u8 sta  
 *@param[out]  无
 *@retval:	   static OK
 */
static s32 drv_ILI9325_display_onoff(DevLcdNode *lcd, u8 sta)
{
	u16 tmp[2];
	DevLcdBusNode * node;
	
	node = bus_lcd_open(lcd->dev.buslcd);

	if(sta == 1)
	{
		bus_lcd_write_cmd(node, (0X07));
		tmp[0] = 0x0173;
		bus_lcd_write_data(node, (u8*)tmp, 1);
	}
	else
	{
		bus_lcd_write_cmd(node, (0X07));
		tmp[0] = 0x00;
		bus_lcd_write_data(node, (u8*)tmp, 1);
	}
	bus_lcd_close(node);
	return 0;
}

/**
 *@brief:	   drv_ILI9325_init
 *@details:    初始化FSMC，并且读取ILI9325的设备ID
 *@param[in]   void  
 *@param[out]  无
 *@retval:	   
 */
s32 drv_ILI9325_init(DevLcdNode *lcd)
{
	u16 data;
	u16 tmp[16];
	DevLcdBusNode * node;
	
	node = bus_lcd_open(lcd->dev.buslcd);

	bus_lcd_rst(node, 1);
	Delay(50);
	bus_lcd_rst(node, 0);
	Delay(50);
	bus_lcd_rst(node, 1);
	Delay(50);
	/*
		读9325的ID
		
	*/
	bus_lcd_write_cmd(node, (0x0000));
	tmp[0] = 0x0001;
	bus_lcd_write_data(node, (u8*)tmp, 1);
	
	bus_lcd_write_cmd(node, (0x0000));
	bus_lcd_read_data(node, (u8*)tmp, 1);
    data = tmp[0]; 

	ILI9341_DEBUG(LOG_DEBUG, "read reg:%04x\r\n", data);
	if(data != TftLcdILI9325Drv.id)
	{
		ILI9341_DEBUG(LOG_DEBUG, "lcd drive no 9325\r\n");	
		bus_lcd_close(node);
		return -1;
	}
	
	bus_lcd_write_cmd(node, (0x00E5));
	tmp[0] = 0x78F0;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0001));
	tmp[0] = 0x0100;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0002));
	tmp[0] = 0x0700;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0003));
	tmp[0] = 0x1030;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0004));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0008));
	tmp[0] = 0x0202;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0009));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

