wujique/stm32f407/board_dev/dev_ILI9341.c
	bus_lcd_write_cmd(node, (0x000A));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x000C));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x000D));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x000F));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0010));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0011));
	tmp[0] = 0x0007;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0012));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0013));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0007));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0010));
	tmp[0] = 0x1690;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0011));
	tmp[0] = 0x0227;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0012));
	tmp[0] = 0x009D;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0013));
	tmp[0] = 0x1900;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0029));
	tmp[0] = 0x0025;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x002B));
	tmp[0] = 0x000D;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0030));
	tmp[0] = 0x0007;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0031));
	tmp[0] = 0x0303;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0032));
	tmp[0] = 0x0003;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0035));
	tmp[0] = 0x0206;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0036));
	tmp[0] = 0x0008;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0037));
	tmp[0] = 0x0406;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0038));
	tmp[0] = 0x0304;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0039));
	tmp[0] = 0x0007;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x003C));
	tmp[0] = 0x0602;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x003D));
	tmp[0] = 0x0008;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	/*
	Horizontal and Vertical RAM Address Position 219*319
	设置扫描窗口

	*/
	bus_lcd_write_cmd(node, (0x0050));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0051));
	tmp[0] = 0x00EF;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0052));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0053));
	tmp[0] = 0x013F;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	//-------------------------------------
	bus_lcd_write_cmd(node, (0x0060));
	tmp[0] = 0xA700;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0061));
	tmp[0] = 0x0001;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x006A));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0080));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0081));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0082));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0083));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);	

	bus_lcd_write_cmd(node, (0x0084));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0085));
	tmp[0] = 0x0000;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0090));
	tmp[0] = 0x0010;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0092));
	tmp[0] = 0x0600;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x0007));
	tmp[0] = 0x0133;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_write_cmd(node, (0x00));
	tmp[0] = 0x0022;
	bus_lcd_write_data(node, (u8*)tmp, 1);

	bus_lcd_close(node);
	return 0;
}
/**
 *@brief:      drv_ILI9325_xy2cp
 *@details:    将xy坐标转换为CP坐标
 *@param[in]   无
 *@param[out]  无
 *@retval:     
 */
s32 drv_ILI9325_xy2cp(DevLcdNode *lcd, u16 sx, u16 ex, u16 sy, u16 ey, u16 *hsa, u16 *hea, u16 *vsa, u16 *vea)
{
	/*
		显示XY轴范围
	*/
	if(sx >= lcd->width)
		sx = lcd->width-1;
	
	if(ex >= lcd->width)
		ex = lcd->width-1;
	
	if(sy >= lcd->height)
		sy = lcd->height-1;
	
	if(ey >= lcd->height)
		ey = lcd->height-1;
	/*
		XY轴，实物来看，方向取决于横屏还是竖屏
		CP轴，是控制器显存，
		映射关系取决于扫描方向
	*/
	/* 
		横屏，用户视角的XY坐标，跟LCD扫描的CP坐标要进行一个对调
		而且，9325在横竖屏也要进行映射
		
	*/
	if(lcd->dir == W_LCD)
	{
		*hsa = (lcd->height - ey) - 1;
		*hea = (lcd->height - sy) - 1;
		
		*vsa = sx;
		*vea = ex;
	}
	else
	{
		*hsa = sx;
		*hea = ex;
		*vsa = sy;
		*vea = ey;
	}
	
	return 0;
}
/**
 *@brief:      drv_ILI9325_drawpoint
 *@details:    画点
 *@param[in]   u16 x      
               u16 y      
               u16 color  
 *@param[out]  无
 *@retval:     static
 */
static s32 drv_ILI9325_drawpoint(DevLcdNode *lcd, u16 x, u16 y, u16 color)
{
	u16 hsa,hea,vsa,vea;

	drv_ILI9325_xy2cp(lcd, x, x, y, y, &hsa,&hea,&vsa,&vea);
	drv_ILI9325_set_cp_addr(lcd, hsa, hea, vsa, vea);
	
	DevLcdBusNode * node;
	node = bus_lcd_open(lcd->dev.buslcd);
	
	u16 tmp[2];
	tmp[0] = color;
	bus_lcd_write_data(node, (u8*)tmp, 1);
	bus_lcd_close(node);
	return 0;
}
/**
 *@brief:      dev_ILI9325_color_fill
 *@details:    将一块区域设定为某种颜色
 *@param[in]   u16 sx     
               u16 sy     
               u16 ex     
               u16 ey     
               u16 color  
 *@param[out]  无
 *@retval:     
 */
s32 drv_ILI9325_color_fill(DevLcdNode *lcd, u16 sx,u16 ex,u16 sy,u16 ey,u16 color)
{

